# Bekerja dengan Multiple Sheets

Panggil package pandas seperti berikut

In [1]:
import pandas as pd

Ketika kita mempunyai data salam bentuk spreadsheet, jarang sekali kita menggunakan hanya 1 tab. Pada pembahasan kali ini melakukan pemanggilan data ketika mempunyai multi sheet. Data yang digunakan yaitu data nilai matematika yang mempunyai 2 sheet.

** Sheet Kelamin **
<img src="assets/1.png" width="240" height="240" align="center"/>

** Sheet Nilai ** 
<img src="assets/2.png" width="240" height="240" align="center"/>

Inputkan data_nilai_matematika1.xlsx yang ada di file data dengan nama data_workbook.

In [61]:
# read workbook
data_workbook = pd.ExcelFile('data/data_nilai_matematika1.xlsx')

In [59]:
print(data_workbook)

<pandas.io.excel.ExcelFile object at 0x000000000826D198>

In [ ]:
##### coba cari lagi

##### Attributes

Pada spreadsheet yang digunakan berisikan sheet-sheet yang dapat kita lihat nama-nama sheet-nya sebagai berikut

In [49]:
# get sheet names
data_sheet_names = data_workbook.sheet_names

In [50]:
print(data_sheet_names)

['Kelamin', 'Nilai']

Dari data excel, kita ketahui dari output diatas mempunyai 2 sheet yaitu dengan nama Kelamin dan Nilai.

##### Attributes vs methods vs functions

** Attributes **
- object.attribute
- workbook.sheet_names
- Memberitahukan sesuatu (misal : isi dari excel yang dipanggil)
- Always attached to an object! (?)

** Methods **
- object.method()
- workbook.parse()
- Melakukan sesuatu (misalnya: hanya menampilkan isi salah satu variabel)
- Always attached to an object! (?)

** Functions **
- function() or package.function()
- pd.ExcelFile()

Mencetak data variabel "Kelamin" menjadi dataframe

In [51]:
# parce "Nilai" tab
data_kelamin = data_workbook.parse('Kelamin')
print(data_kelamin)

      Nama    Kelamin       NIM
0   ANDI S  Laki-laki  14611155
1      IVA  Perempuan  14611156
2    IHSAN  Laki-laki  14611157
3     DEWI  Perempuan  14611158
4   KURNIA  Perempuan  14611159
5      EKO  Laki-laki  14611160
6     TIKA  Perempuan  14611161
7    FITRI  Perempuan  14611162
8     GITA  Perempuan  14611163
9   HAFIDZ  Laki-laki  14611164
10    MAYA  Perempuan  14611165
11  LUKMAN  Laki-laki  14611166
12   APRIL  Perempuan  14611167
13     EKA  Perempuan  14611168
14    WATI  Perempuan  14611169

In [52]:
data_nilai = data_workbook.parse('Nilai')
print(data_nilai)

      Nama  Nilai
0   Andi S     80
1      Iva     74
2    Ihsan     75
3     Dewi     76
4   Kurnia     39
5      Eko     65
6     Tika     73
7    Fitri     60
8     Gita     63
9   Hafidz     75
10    Maya     69
11  Lukman     75
12   April     90
13     Eka     84
14    Wati     76

Dari penginputan data diatas bisa kita ketahui sebagai berikut: 
- pd.ExcelFile() (function)
- workbook.sheet_names (attribute)
- workbook.parse() (method)

##### Menggabungkan Tabel

##### Penggabungan : dengan VLOOKUP pada Data Science

Penggabungan Tabel pada python
<br>
Sebelumnya, perlu diketahui bahwa Python merupakan program yang case-sensitive (sensitive terhadap perbedaan. misalnya: huruf besar dengan huruf kecil, spasi, dll).
Misalnya : 
Sensitive huruf besar dan huruf kecil
- 'Andi' != 'andi'
Sensitive terhadap spasi
- 'Andi'!= 'Andi  '
Menggabungkan tabel, misalnya
- AB + ACD = ABCD, jika kita hanya inginkan kolom variabel ABC
- Kita dappat menghapus kolom variabel D.

Keterangan  :
!= :  Tidak sama dengan

##### How to Handle Case-Sensitive

In **data_kelamin** we can see that when we input data for **Nama** variable with capital letters, we can change as we like.

Change data with a lower letter.

In [53]:
data_kelamin['Nama'] = data_kelamin['Nama'].str.lower()
print(data_kelamin)

      Nama    Kelamin       NIM
0   andi s  Laki-laki  14611155
1      iva  Perempuan  14611156
2    ihsan  Laki-laki  14611157
3     dewi  Perempuan  14611158
4   kurnia  Perempuan  14611159
5      eko  Laki-laki  14611160
6     tika  Perempuan  14611161
7    fitri  Perempuan  14611162
8     gita  Perempuan  14611163
9   hafidz  Laki-laki  14611164
10    maya  Perempuan  14611165
11  lukman  Laki-laki  14611166
12   april  Perempuan  14611167
13     eka  Perempuan  14611168
14    wati  Perempuan  14611169

In **data_kelamin**, first **Nama** data have all in capital letters. After using ``str.lower()``, we can change into lower letters.

Change data with all capital letter.

In [54]:
data_kelamin['Nama'] = data_kelamin['Nama'].str.upper()
print(data_kelamin)

      Nama    Kelamin       NIM
0   ANDI S  Laki-laki  14611155
1      IVA  Perempuan  14611156
2    IHSAN  Laki-laki  14611157
3     DEWI  Perempuan  14611158
4   KURNIA  Perempuan  14611159
5      EKO  Laki-laki  14611160
6     TIKA  Perempuan  14611161
7    FITRI  Perempuan  14611162
8     GITA  Perempuan  14611163
9   HAFIDZ  Laki-laki  14611164
10    MAYA  Perempuan  14611165
11  LUKMAN  Laki-laki  14611166
12   APRIL  Perempuan  14611167
13     EKA  Perempuan  14611168
14    WATI  Perempuan  14611169

After using ``str.upper()`` can change into capital letter.

In [55]:
data_kelamin['Nama'] = data_kelamin['Nama'].str.title()
print(data_kelamin)

      Nama    Kelamin       NIM
0   Andi S  Laki-laki  14611155
1      Iva  Perempuan  14611156
2    Ihsan  Laki-laki  14611157
3     Dewi  Perempuan  14611158
4   Kurnia  Perempuan  14611159
5      Eko  Laki-laki  14611160
6     Tika  Perempuan  14611161
7    Fitri  Perempuan  14611162
8     Gita  Perempuan  14611163
9   Hafidz  Laki-laki  14611164
10    Maya  Perempuan  14611165
11  Lukman  Laki-laki  14611166
12   April  Perempuan  14611167
13     Eka  Perempuan  14611168
14    Wati  Perempuan  14611169

After using ``str.title()``, we can change into an upper letter for first word.

##### Space Handling

In [62]:
# Handling whitespace with .str.strip()
data_kelamin['Nama'] = data_kelamin['Nama'].str.strip()
print(data_kelamin)

      Nama    Kelamin       NIM
0   Andi S  Laki-laki  14611155
1      Iva  Perempuan  14611156
2    Ihsan  Laki-laki  14611157
3     Dewi  Perempuan  14611158
4   Kurnia  Perempuan  14611159
5      Eko  Laki-laki  14611160
6     Tika  Perempuan  14611161
7    Fitri  Perempuan  14611162
8     Gita  Perempuan  14611163
9   Hafidz  Laki-laki  14611164
10    Maya  Perempuan  14611165
11  Lukman  Laki-laki  14611166
12   April  Perempuan  14611167
13     Eka  Perempuan  14611168
14    Wati  Perempuan  14611169

We can see that in **Kelamin** data, in **Nama** variable with has two spaces, using ``str.strip()`` it will be just one space.

##### Choosing and Deleting Column

Choosing data from sheet **Kelamin** for **Nama** and **Kelamin** variable.

In [23]:
# selecting columns
data_kelamin[['Nama','Kelamin']]

      Nama    Kelamin
0     Andi  Laki-laki
1      Iva  Perempuan
2    Ihsan  Laki-laki
3     Dewi  Perempuan
4   Kurnia  Perempuan
5      Eko  Laki-laki
6     Tika  Perempuan
7    Fitri  Perempuan
8     Gita  Perempuan
9   Hafidz  Laki-laki
10    Maya  Perempuan
11  Lukman  Laki-laki
12   April  Perempuan
13     Eka  Perempuan
14    Wati  Perempuan

##### Deleting column with drop()

If we are not needed to using **Kelamin** variable in data, we can just deleting that column.

In [25]:
# drop columns
data_kelamin.drop('Kelamin', axis=1)

      Nama       NIM
0     Andi  14611155
1      Iva  14611156
2    Ihsan  14611157
3     Dewi  14611158
4   Kurnia  14611159
5      Eko  14611160
6     Tika  14611161
7    Fitri  14611162
8     Gita  14611163
9   Hafidz  14611164
10    Maya  14611165
11  Lukman  14611166
12   April  14611167
13     Eka  14611168
14    Wati  14611169

##### Menggabungkan Tabel : VLOOKUP pada Python

Merge Table:

Menggabungkan sheet data_kelamin dengan sheet data_nilai dengan menyatukan dengan variabel yang sama yaitu "Nama" dan data di sheet data_nilai diposisi kiri sheet data_kelamin.

In [67]:
data_kelamin.merge(data_nilai, on='Nama', how='left')

      Nama    Kelamin       NIM  Nilai
0   Andi S  Laki-laki  14611155     80
1      Iva  Perempuan  14611156     74
2    Ihsan  Laki-laki  14611157     75
3     Dewi  Perempuan  14611158     76
4   Kurnia  Perempuan  14611159     39
5      Eko  Laki-laki  14611160     65
6     Tika  Perempuan  14611161     73
7    Fitri  Perempuan  14611162     60
8     Gita  Perempuan  14611163     63
9   Hafidz  Laki-laki  14611164     75
10    Maya  Perempuan  14611165     69
11  Lukman  Laki-laki  14611166     75
12   April  Perempuan  14611167     90
13     Eka  Perempuan  14611168     84
14    Wati  Perempuan  14611169     76

##### lef_on and right ketika .merge()

Pada kasus ini misalkan kita inputkan data_nilai_matematika2.xlsx

In [72]:
# read workbook
data_workbook = pd.ExcelFile('data/data_nilai_matematika2.xlsx')

Sebelumnya, mari kita lihat data pada data_nilai_matematika2.xlsx.  Melihat data sheet kelamin.

In [78]:
data_kelamin = data_workbook.parse('Kelamin')
data_kelamin.head()

     Nama    Kelamin
0    Andi  Laki-laki
1     Iva  Perempuan
2   Ihsan  Laki-laki
3    Dewi  Perempuan
4  Kurnia  Perempuan

Pada output diatas data_kelamin terdapat variabel "Nama" dan "Kelamin".

Melihat data pada sheet Nilai

In [79]:
data_nilai = data_workbook.parse('Nilai')
data_nilai.head()

  Nama Siswa  Nilai
0       Andi     80
1        Iva     74
2      Ihsan     75
3       Dewi     76
4     Kurnia     39

Pada output diatas data_kelamin terdapat variabel "Nama Siswa" dan "Kelamin".

Menggabungkan data_kelamin dengan data_nilai ketika datanya sama tetapi nama variabelnya berbeda.

In [81]:
data_gabung = data_kelamin.merge(data_nilai, 
                   left_on='Nama', 
                   right_on='Nama Siswa', 
                   how='left')
data_gabung

      Nama    Kelamin Nama Siswa  Nilai
0     Andi  Laki-laki       Andi     80
1      Iva  Perempuan        Iva     74
2    Ihsan  Laki-laki      Ihsan     75
3     Dewi  Perempuan       Dewi     76
4   Kurnia  Perempuan     Kurnia     39
5      Eko  Laki-laki        Eko     65
6     Tika  Perempuan       Tika     73
7    Fitri  Perempuan      Fitri     60
8     Gita  Perempuan       Gita     63
9   Hafidz  Laki-laki     Hafidz     75
10    Maya  Perempuan       Maya     69
11  Lukman  Laki-laki     Lukman     75
12   April  Perempuan      April     90
13     Eka  Perempuan        Eka     84
14    Wati  Perempuan       Wati     76

Dapat dilihat pada syntax bahawa penggabungan dengan variabel "Nama" pada sheet Kelamin dan variabel "Nama Siswa" pada sheet Nilai. Pada data tersebut terdapat nama yang double maka lebih baik kita hapus salah satunya.

Dalam hal ini penulis menghapus variabel "Nama Siswa"

In [82]:
# drop columns
data_gabung.drop('Nama Siswa', axis=1)

      Nama    Kelamin  Nilai
0     Andi  Laki-laki     80
1      Iva  Perempuan     74
2    Ihsan  Laki-laki     75
3     Dewi  Perempuan     76
4   Kurnia  Perempuan     39
5      Eko  Laki-laki     65
6     Tika  Perempuan     73
7    Fitri  Perempuan     60
8     Gita  Perempuan     63
9   Hafidz  Laki-laki     75
10    Maya  Perempuan     69
11  Lukman  Laki-laki     75
12   April  Perempuan     90
13     Eka  Perempuan     84
14    Wati  Perempuan     76